Documents/ЗаявкаНаВыплатуКоммРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВыплатуКоммРасходов</Name>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыПоАктам</xr:Item>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаКоммерческихРасходов</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспеченоПоСтатье</xr:Item>
				<xr:Item>AccumulationRegister.ВыплатыКоммерческихРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлиентМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КлиентМенеджеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлиентМенеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПоДокументам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ДокументУТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКРпоАкту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКРпоОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/БюджетПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетПоМесяцам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Comment>Факт облагается РКО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСуммыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОбеспеченоПоСтатье.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОбеспеченоПоСтатье</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/БонусыПоАктам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БонусыПоАктам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДокументУТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОплатаКоммерческихРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОплатаКоммерческихРасходов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлиентМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТиповыхЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНачисления</Name>
					<Comment>0-КР (аванс), 1-КР по документу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВыплатыКоммерческихРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ВыплатыКоммерческихРасходов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлиентМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТиповыхЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипСуммыБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипСуммыБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПервичныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СтатусыПроектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бланк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаВыплатуКоммРасходов/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЗадачиПроектов") Тогда
		// Заполнение шапки
		ЗадачаПроекта = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	ПериодРегистрации		= НачалоМесяца( ТекущаяДата());
	
КонецПроцедуры

Функция УжеЕстьЗаявка() 
	// виды тз в распределении	
	мВидыТЗ = Новый Массив;
	Для Каждого Стр ИЗ РаспределениеПоДокументам Цикл
		ВидТЗ = Стр.ЗадачаПроекта.ТиповаяЗадача.ВидТиповойЗадачи;
		Если мВидыТЗ.Найти( ВидТЗ ) = Неопределено Тогда
			мВидыТЗ.Добавить( ВидТЗ );
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаявкаКР.Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаВыплатуКоммРасходов.РаспределениеПоДокументам КАК ЗаявкаКР
		|ГДЕ
		|	ЗаявкаКР.Ссылка <> &Ссылка
		|	И ЗаявкаКР.Ссылка.Проведен
		|	И ЗаявкаКР.Ссылка.КлиентМенеджер = &КлиентМенеджер
		|	И ЗаявкаКР.Ссылка.ПериодРегистрации = &ПериодРегистрации
		|	И ЗаявкаКР.ЗадачаПроекта.ТиповаяЗадача.ВидТиповойЗадачи В(&ВидыТЗ)";

	Запрос.УстановитьПараметр("КлиентМенеджер", 	КлиентМенеджер);
	Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
	Запрос.УстановитьПараметр("ВидыТЗ", 			мВидыТЗ);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

// в регистр Бюджет по месяцам
Процедура ДобавитьДвижениеБюджетПоМесяцам( ЗадачаПроекта, СтатьяСметы, Сумма )
			
	Движение = Движения.БюджетПоМесяцам.Добавить();
	Движение.Период 		= Дата;
	Движение.ЗадачаПроекта 	= ЗадачаПроекта;
	Движение.СтатьяСметы	= СтатьяСметы;
	Движение.ТипСуммы 		= Перечисления.ТипСуммыБюджета.Факт;
	Движение.Месяц		 	= НачалоМесяца(ПериодРегистрации);
	Движение.Сумма 			= Сумма;
	// РКО - всегда нал
	Движение.РКО 			= 1;
КонецПроцедуры

// в регистр Обеспечено по статье
Процедура ДобавитьДвижениеОбеспеченоПоСтатье( ЗадачаПроекта, СтатьяСметы, Сумма )
			
	// регистр ОбеспеченоПоСтатье Расход
	Движения.ОбеспеченоПоСтатье.Записывать = Истина;
	Движение 				= Движения.ОбеспеченоПоСтатье.Добавить();
	Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
	Движение.Период 		= Дата;
	Движение.ЗадачаПроекта 	= ЗадачаПроекта;
	Движение.СтатьяСметы	= СтатьяСметы;
	// 
	Движение.Сумма 			= Сумма;
КонецПроцедуры


Функция СверткаРаспределенияПоМиВЗ()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаспрПоДок.Менеджер КАК КлиентМенеджер,
		|	СУММА(РаспрПоДок.СуммаКРпоОплате) КАК Сумма,
		|	РаспрПоДок.ЗадачаПроекта.ТиповаяЗадача.ВидТиповойЗадачи КАК ВидТЗ
		|ИЗ
		|	Документ.ЗаявкаНаВыплатуКоммРасходов.РаспределениеПоДокументам КАК РаспрПоДок
		|ГДЕ
		|	РаспрПоДок.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспрПоДок.ЗадачаПроекта.ТиповаяЗадача.ВидТиповойЗадачи,
		|	РаспрПоДок.Менеджер";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;

КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	Если УжеЕстьЗаявка() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Уже есть заявка на выплату по " + КлиентМенеджер + " за " + Формат( ПериодРегистрации, "ДФ='ММММ гггг'");
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//СтатьяБюджета = Справочники.СтатьиСметы.РасходыКоммерческие;
	СтатьяБюджета = Справочники.СтатьиСметы.ВознаграждениеКМ;
	
	// новый регистр   29,04,2013
	Движения.БюджетПоМесяцам.Записывать = Истина;
	// регистр ОбеспеченоПоСтатье Расход
	Движения.ОбеспеченоПоСтатье.Записывать = Истина;
	
	// регистр БонусыПоАктам Расход
	Движения.БонусыПоАктам.Записывать = Истина;
	
	// 2014.02.18
	// новый регистр накопления ОплатаКоммерческихРасходов
	Движения.ОплатаКоммерческихРасходов.Записывать = Истина;
	
	
	тзРПД = РаспределениеПоДокументам.Выгрузить();
	// 2013,10,22
	тзРПД.Свернуть("ЗадачаПроекта", "СуммаКРпоОплате");
	Для Каждого СтрТЗ ИЗ тзРПД Цикл
		// 2013,10,22
		Сумма	= СтрТЗ.СуммаКРпоОплате;
		Если Сумма = 0 Тогда Продолжить; КонецЕсли;
		ЗадачаПроекта 			= СтрТЗ.ЗадачаПроекта;
		
		// в бюджет по месяцам			
		ДобавитьДвижениеБюджетПоМесяцам( ЗадачаПроекта, СтатьяБюджета, Сумма );
		// обеспечено по статье
		ДобавитьДвижениеОбеспеченоПоСтатье( ЗадачаПроекта, СтатьяБюджета, Сумма );
		
	КонецЦикла;
	
	// не сворачиваем по актам
	Для Каждого ТекСтрокаРаспределениеПоДокументам Из РаспределениеПоДокументам Цикл
		
		Движение 				= Движения.БонусыПоАктам.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаРаспределениеПоДокументам.ЗадачаПроекта;
		Движение.Акт 			= ТекСтрокаРаспределениеПоДокументам.Акт;
		Движение.Сумма 			= ТекСтрокаРаспределениеПоДокументам.СуммаКРпоОплате;
		
		
		// 2014.02.18
		// оплата коммерческих расходов
		// приход
		Если ТекСтрокаРаспределениеПоДокументам.СуммаКРпоОплате <> 0 Тогда
			Движение				= Движения.ОплатаКоммерческихРасходов.ДобавитьПриход();
			Движение.Период			= Дата;
			Движение.КлиентМенеджер	= ТекСтрокаРаспределениеПоДокументам.Менеджер;
			Движение.ВидТЗ			= ТекСтрокаРаспределениеПоДокументам.ЗадачаПроекта.ТиповаяЗадача.ВидТиповойЗадачи;
			Движение.ТипНачисления	= 1; 
			Движение.Сумма			= ТекСтрокаРаспределениеПоДокументам.СуммаКРпоОплате;
		КонецЕсли;
		
	КонецЦикла;
	
	// 2014,04,16 новый регистр
	Движения.ВыплатыКоммерческихРасходов.Записывать = Истина;
	// собираем по менеджерам и видам типовой задачи
	тз = СверткаРаспределенияПоМиВЗ();
	Для Каждого СтрСв ИЗ ТЗ  Цикл
		Движение = Движения.ВыплатыКоммерческихРасходов.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		
		// в строке в колонке Сумма стоит СуммаКРпоОплате
		// см функцию СверткаРаспределенияПоМиВЗ()
		ЗаполнитьЗначенияСвойств( Движение, СтрСв );
	КонецЦикла;
	//
	Движения.Записать();
	
	// функция - заглушка
	Остаток = ПолучитьОстатокКоммерческихРасходовПоМенеджеру( КлиентМенеджер );
	
	Если Остаток < 0 Тогда 
		Сообщить("Не хватает остатка по менеджеру " + Формат(Остаток, "ЧЦ=15; ЧДЦ=2"));
		//Отказ = Истина;
		//Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И НЕ ВсеЗадачиВУказанномСтатусе( Перечисления.СтатусыПроектов.ВРаботе, 
										Ссылка.РаспределениеПоДокументам.Выгрузить(, "ЗадачаПроекта") ) Тогда
		Сообщить("Не все проекты в статусе " + Перечисления.СтатусыПроектов.ВРаботе );
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры
